artillery/Entity2.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Starting the application"
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: "Warm up the application"
    - duration: 30
      arrivalRate: 15
      name: "Sustained max load"
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
      email:
        - "test21@test.com"
      password:
        - "test21"
  ensure:
    maxErrorRate: 1
  processor: "./general_artillery.js"
scenarios:
  - name: "Entity2 Tests"
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            json: "$.data.token"
            as: "token"
      - get:
          url: '/api/entity2'
          headers:
            Authorization: 'Bearer {{ token }}'
          capture:
            json: "$.data[0].MyString"
            as: "MyString"
      - post:
          url: '/api/entity2'
          headers:
            Authorization: 'Bearer {{ token }}'
          json:
            MyString: 'MyString'
            MyNumber: '12345'
            MyDescription: 'MyDescription'
            Entity1_Id: '5c3f3d3068186320881bf209'
          capture:
            json: "$.data._id"
            as: "_id"
      - get:
          url: '/api/entity2/{{_id}}'
          headers:
            Authorization: 'Bearer {{ token }}'
          capture:
            json: "$.data.createdAt"
            as: "createdAt"
      - put:
          url: '/api/entity2/{{_id}}'
          headers:
            Authorization: 'Bearer {{ token }}'
          json:
            MyString: 'MyString_Updated'
            MyNumber: '67890'
            MyDescription: 'MyDescription_Updated'
      - delete:
          url: '/api/entity2/{{_id}}'
          headers:
            Authorization: 'Bearer {{ token }}'
      - log: " - Token: {{ token }} - _id: - {{ _id }} - createdAt: {{createdAt}}"