artillery/ResetPasswordRequest.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Starting the application"
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: "Warm up the application"
    - duration: 30
      arrivalRate: 15
      name: "Sustained max load"
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
      email:
        - "test21@test.com"
  ensure:
    maxErrorRate: 1
  processor: "./general_artillery.js"
scenarios:
  - name: "Reset Password Request Test"
    flow:
      - post:          
          url: '/api/auth/reset_password_request'
          json:
            email: '{{ email }}'
      - log: " - Email: {{ email }}"