artillery/ValidateToken.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
      name: "Starting the application"
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: "Warm up the application"
    - duration: 30
      arrivalRate: 15
      name: "Sustained max load"
  defaults:
    headers:
      Content-Type: 'application/json'
  variables:
      email:
        - "test21@test.com"
      password:
        - "test21"
  ensure:
    maxErrorRate: 1
  processor: "./general_artillery.js"
scenarios:
  - name: "Validate Token Test"
    flow:
      - post:
          url: '/api/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            json: "$.data.token"
            as: "token"
      - post:
          url: '/api/auth/validate_token'
          json:
            token: '{{ token }}'
      - log: " - Token: {{ token }}"